# A/B-тестирование 

**Ход исследования**

В нашем распоряжении есть датасет с действиями пользователей, техническое задание и несколько вспомогательных датасетов.

Перед анализом предстоит изучить общую информацию о датасетах, понять, какая информация есть в столбцах датасета и какого типа данные в них хранятся. Затем провести предоработку данных и только после этого переходить к процессу оценки корректности проведения теста и анализу его результатов. Чтобы оценить корректность проведения теста необходимо удостовериться, что нет пересечений с конкурирующим тестом и нет пользователей, участвующих в двух группах теста одновременно. А также, проверить равномерность распределения пользователей по тестовым группам и правильность их формирования.

Таким образом, исследование пройдёт в четыре этапа:
 1. Обзор данных.
 2. Предобработка данных.
 3. Оценка корректности проведения теста.
 4. Анализ результатов А/В теста.
 
 **Цель исследования** — провести оценку результатов A/B-теста.
